SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( cp1311
	Type ( Engine )
	Thumbnail ( loco.ace )
	WagonShape ( cp1311.s )
	Size ( 3.050m 4.300m 17.060m )
	CentreOfGravity ( 0m 1.668m 0m )
	Mass ( 95.4t )
	WheelRadius ( 20in )
	InertiaTensor ( Box (3.05m 4.3m 17.060m) )
	Coupling (
		Type ( Chain )
		Spring (
			Stiffness ( 1.1e6N/m 4.8e6N/m )
			Damping ( 1.2e6N/m/s 3.4e6N/m/s )
			Break ( 3.4e7N 3.4e7N )
			r0 ( 1cm 30cm )
		)
		CouplingHasRigidConnection ()
		Velocity ( 0.1m/s )
	)
	Coupling (
		Type ( Chain )
		Spring (
			Stiffness ( 4.8e6N/m 1.1e6N/m )
			Damping ( 3.4e6N/m/s 1.2e6N/m/s )
			Break ( 3.4e7N 3.4e7N )
			r0 ( 30cm 1cm )
		)
		CouplingHasRigidConnection ()
		Velocity ( -0.1m/s )
	)
	Buffers (
		Spring (
			Stiffness ( 1e7N/m 0 )
			Damping ( 1e6N/m/s 0 )
			r0 ( 0m 1e9 )
		)
		Centre ( 0.5m )
		Radius ( 1m )
		Angle ( 0.5deg )
	)	
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 477kN )
	DerailBufferForce ( 150kN )
	NumWheels (	1 )
	Friction (
		114N/m/s		0		1mph			0		1
		5.1N/rad/s		1		-1rad/s		0		1
	)
	BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
	BrakeSystemType ( "Vacuum_single_pipe" )
	MaxBrakeForce ( 168kN )

	MaxHandbrakeForce( 80kN )
	NumberOfHandbrakeLeverSteps( 100 )
	MaxReleaseRate( 30 )
        MaxReleaseRate( 10 )
        MaxApplicationRate( 10 )
        MaxAuxilaryChargingRate( 10 )
        BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )

	IntakePoint ( -1.0 0.4 FuelDiesel )
	IntakePoint ( 1.0 0.4 FuelDiesel )

	Lights	(	3
		Light	(
			comment( Sphere of light )
			Type		( 1 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.0 3.5 18 )
					Transition ( 0 )
					Radius ( 450.0 )
					Angle ( 15.0 )
					)
				)
			)
		Light	(
			comment( Head light dim )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( 0.00 3.41 7.84 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
		Light	(
			comment( Head light bright )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.00 3.41 7.84 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 1.3 )
				)
			)
		)
	)
    	Sound (	"1300Eng.sms" )
	)

Engine ( cp1311
	Effects
		(
		DieselSpecialEffects
			(
				comment
				(
					the format of these little blocks is as follow:

					offset.x offset.y offset.z
					normal.x normal.y normal.z
					width in metres

					defining the offset from the shape pivot point
					where steam / smoke should appear, the direction
					it should go and the width of the nozzle
				)

				Exhaust1
				(
					-0.56 4.296 -2.916
					0 1 0
					0.1
				)
				Exhaust2
				(
					0.56 4.296 2.916
					0 1 0
					0.1
				)
			)
        	)
        
	Wagon ( cp1311 )
	Type ( Diesel )
	MaxPower ( 751kW )
	MaxForce ( 180kN )	
	MaxContinuousForce ( 112kN )
	MaxVelocity ( 83mph )
	MaxCurrent ( 1500A ) 
	WheelRadius ( 20in )
	Sanding ( 1e9mph )

	NumWheels ( 12 )
	MaxTemperature ( 120 )
	MaxOilPressure ( 90 )

      VacuumBrakesSmallEjectorPowerRating( 3.5 )
	VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
	VacuumBrakesSmallEjectorUsageRate( 500 )
	VacuumBrakesLargeEjectorUsageRate( 2400 )
	VacuumBrakesHasVacuumPump( 0 )

	TrainBrakesControllerMaxReleaseRate( 12 )
	TrainBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMaxSystemPressure( 21 )

	EngineBrakesControllerHasProportionalBrake( 1 )
      EngineBrakesProportionalBrakeLag( 0.9 )

	BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
	BrakesTrainBrakeType ( "Vacuum_single_pipe" )
      BrakesEngineControllers( "Hand, Train" )

    DoesBrakeCutPower( 1 )
    DoesHornTriggerBell( 0 )
    BrakeCutsPowerAtBrakeCylinderPressure( 15 )

	EngineBrakesControllerDirectControlExponent( 1 )

 	CabView ( cp1300.cvf )
	HeadOut (  1.55 3.341 0.75 )
	MaxDieselLevel ( 581gal )
	DieselUsedPerHourAtMaxPower ( 60gal )
	DieselUsedPerHourAtIdle ( 6gal )
    
	DieselSmokeEffectInitialMagnitude( 1.5 )
	DieselSmokeEffectMaxMagnitude( 1.5 )
	DieselSmokeEffectInitialSmokeRate( 0.8 )
	DieselSmokeEffectMaxSmokeRate( 2.5 )	
	
	DieselEngineIdleRPM( 1100 )
	DieselEngineMaxRPM( 3000 )
	DieselEngineSpeedOfMaxTractiveEffort( 19mph )        
      DieselEngineMaxRPMChangeRate( 40 )
	DieselEngineType ( Electric )

	DoesHornTriggerBell( 0 )

	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 1 )
    		MonitoringDeviceAppliesCutsPower( 0 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    		)

	AWSMonitor(
		MonitoringDeviceMonitorTimeLimit( -1 )
		MonitoringDeviceAlarmTimeLimit( 5 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)
	
	EngineVariables( 3600 )
			
        EngineControllers (
            Throttle ( 0 1 0.125 0 0.
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.125   0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.375   0 Dummy )
                    Notch ( 0.5     0 Dummy )
                    Notch ( 0.625   0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 0.875   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
            Brake_Engine ( 0 1 0.0125 0 
                NumNotches ( 1
                    Notch ( 0       1 Dummy )                    
                )
            )
            Brake_Train ( 0 1 0.0125 0.75 
                NumNotches ( 5
                    Notch ( 0    0 TrainBrakesControllerReleaseStart )
                    Notch ( 0.15 1 TrainBrakesControllerGraduatedSelfLapLimitedStart )
                    Notch ( 0.65 0 TrainBrakesControllerSuppressionStart )
                    Notch ( 0.80 0 TrainBrakesControllerContinuousServiceStart )
                    Notch ( 0.95 0 TrainBrakesControllerEmergencyStart )
                )
            )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopResetToggle( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
        )
        
    	Sound (	"1300Cab.sms" )
    	Name ("CP 1311 Whitcomb")
    	Description (
	"	The 1300 diesel-electric locomotive started it's service in 1952\n"+
	"with a green and silver livery.\n"+
	"	CP bought a total of 12 of these locomotives, in sequence of the\n"+
	"second phas of the "Plan Marshall". They first severd in the Sintra\n"+
	"Line, doing suburban service. They also served in the North Line but\n"+
	"only between Lisboa and Gaia. They were not fitted to cross the\n"+
	""D. Maria" bridge, and therefore they were never seen in the north of\n"+
	"Portugal. Other prestigious services include the traction of the "Sud-Express".\n"+
	"	With the comming of english electric material (1400  and 1800) and\n"+
	"electrification of the North Line, these locomotives were sent to the\n"+
	"southern regions of Portugal. In the begining of the 70's all of them\n"+
	"were on Alentejo and Algarve, until the end of their days.\n"+
	"In late 1985 only the 1304 was in service and it was a short time since\n"+
	"it was put aside. Today, only one is preserved in original CP livery,\n"+
	"for the museum. It's the 1311 . This one was recovered by EMEF in 1998\n"+
 	"for the comemoration of the 50 years of Diesel Traction in Portugal\n\n"+
	"Locomotive type: Diesel-Electric\n\n"+
	"Power source: Two CC 1604-D Generator\n\n"+
	"Power: 1020 hp by 4 362-RZ tracion engines\n\n"+
	"Max. speed: 134 kmh\n\n"+
	"Gear ratio: 65:18\n\n"+
	"Diesel Engine: Two Superior 40 B-Lx with 6 Lv cilinders \n\n"+
	"Max. continuous tractive effort: 11.140 kg\n\n"+
	"Wheel configuration: Six 1.016 m wheels in A1A A1A configuration\n\n"+
	"Height: 4.300 m\n\n"+
	"Weight: 95,40 ton\n\n"+
	"Length: 17,060 m\n\n"+
	"Width: 3,050 m"
    	)
    	EngineOperatingProcedures (
    	"To move forward\n"+
	"1.	Press the W key to move the Reverser to Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
	"4.	Press the D key to move the throttle from Idle to Notch 1.\n"+
	"5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the throttle to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the dynamic brakes\n"+
	"1.	Press the A key to move the throttle to the Idle position.\n"+
	"2.	Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position. After allowing a few seconds for braking circuit setup, press the . (PERIOD) key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
	"To release the dynamic brakes\n"+
	"1. Press the D key to move the throttle towards Idle.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
	"To bail off the train brakes on the locomotive\n"+
	"1. Press the / (FORWARD SLASH) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
	"To apply the locomotive brake\n"+
	"1.	Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
	"To release the locomotive brake\n"+
	"1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
	"To activate emergency braking\n"+
	"1.	Press the A key to reduce the throttle to Idle.\n"+
	"2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+
	"2.	Press the S key to move the Reverser to the Reverse position.\n"+
	"3.	Release the brakes.\n"+
	"4.	Slowly advance the throttle lever (D key).\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window."
    	) 
)

